Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The example below defines a function called minMax(array:), which finds the smallest and largest numbers in an array of Int values:
ja: 下の例はminMax(array:)と呼ばれる関数を定義します、それは、あるInt値の配列の中で最小および最大の数を見つけます：

source: The example below defines a generic function called allItemsMatch, which checks to see if two Container instances contain the same items in the same order.
ja: 下の例はallItemsMatchと呼ばれる総称体関数を定義します、それは、２つのContainerインスタンスが同じ順序で同じ項目を含むかどうか見るために調べます。

source: The example below defines a global function called someFunction(), without providing a specific access-level modifier for the function itself.
ja: 下の例は、その関数自身に特定のアクセス水準修飾子を提供することなく、someFunction()と呼ばれるグローバル関数を定義します。

source: The example below defines a new class called StepCounter, which tracks the total number of steps that a person takes while walking.
ja: 下の例は、StepCounterと呼ばれる新しいクラスを定義します、それは、ある人が歩いている間にとる総歩数を追跡します。

source: The example below defines a new structure called Fahrenheit to store temperatures expressed in the Fahrenheit scale.
ja: 下の例は、Fahrenheitと呼ばれる新しい構造体を定義して、華氏尺度で表される温度を格納します。

source: The example below defines a protocol called Togglable, which defines a single instance method requirement called toggle.
ja: 下の例は、Togglableと呼ばれるプロトコルを定義します、それは、toggleと呼ばれる１つのインスタンスメソッド要件を定義します。

source: The example below defines a structure called Animal, with a constant String property called species.
ja: 以下の例は、Animalと呼ばれるある構造体を、speciesと呼ばれる定数Stringプロパティを使って定義します。

source: The example below defines a structure called BlackjackCard, which models a playing card as used in the game of Blackjack.
ja: 下記の例はBlackjackCardと呼ばれる構造体を定義します、それは、「ブラックジャック」ゲームにおいて使われるときの遊戯カード、トランプカードをモデル化します。

source: The example below defines a structure called Chessboard, which models a board for the game of chess.
ja: 下の例はChessboardと呼ばれる構造体を定義します、それは、「チェス」ゲーム用の盤をモデル化します。

source: The example below defines a structure called FixedLengthRange, which describes a range of integers whose range length cannot be changed after it is created:
ja: 以下の例はFixedLengthRangeと呼ばれる構造体を定義します、それは、それが作成された後に範囲長が変更されることが出来ない、整数からなるある範囲を記述します：

source: The example below defines a structure called LevelTracker, which tracks a player’s progress through the different levels or stages of a game.
ja: 下の例はLevelTrackerと呼ばれる構造体を定義します、それは、プレイヤーの進み具合をゲームの異なるレベルまたはステージを通して追跡します。

source: The example below defines a structure called Size with two properties called width and height.
ja: 下の例は、widthとheightと呼ばれる２つのプロパティをもつSizeと呼ばれる構造体を定義します。

source: The example below defines a structure called TrackedString, which keeps track of the number of times a string property is modified:
ja: 下の例はTrackedStringと呼ばれる構造体を定義します、それは、ある文字列プロパティが修正される回数を追跡します：

source: The example below defines a subclass of Product called CartItem.
ja: 下の例は、CartItemと呼ばれるProductのサブクラスを定義します。

source: The example below defines an enumeration called OnOffSwitch.
ja: 下の例は、OnOffSwitchと呼ばれる列挙を定義します。

source: The example below defines an enumeration called TemperatureUnit, with three possible states (kelvin, celsius, and fahrenheit).
ja: 以下の例は、３つの可能な状態（kelvin、celsius、そしてfahrenheit）を持つ、TemperatureUnitと呼ばれる列挙を定義します。

source: The example below defines two classes, Country and City, each of which stores an instance of the other class as a property.
ja: 下の例は２つのクラス、CountryとCityを定義します、そして、そのそれぞれは他のクラスのインスタンスをプロパティとして格納します。

source: The example below defines two protocols for use with dice-based board games:
ja: 下の例は、さいころに基づく様々なボードゲームで使うために、２つのプロトコルを定義します：

source: The example below defines two variables, movieCount and songCount, which count the number of Movie and Song instances in the library array:
ja: 下の例は２つの変数、movieCountとsongCountを定義します、それは、MovieとSongインスタンスの数をlibrary配列において数えます：

source: The example below exposes the getter for the enabled property of the ExampleClass to Objective-C code as isEnabled rather than just as the name of the property itself.
ja: 以下の例は、ExampleClassのenabledプロパティのためのゲッターをObjective-Cコードに、ただプロパティそれ自身の名前ではなくisEnabledとして露出します。

source: The example below extends the Container protocol from the previous examples to add a startsWith(_:) method.
ja: 下の例は、以前の例のContainerプロトコルを拡張して、startsWith(_:)メソッドを追加します。

source: The example below extends the generic Stack structure from the previous examples to add an isTop(_:) method.
ja: 下の例は、以前の例の総称体Stack構造体を拡張して、isTop(_:)メソッドを加えます。

source: The example below implements an addition assignment operator method for Vector2D instances:
ja: 下の例は、Vector2Dインスタンスのために追加代入演算子メソッドを実装します：

source: The example below is identical to the Person and Apartment example from above, with one important difference.
ja: 下の例は、上記のPersonとApartment例に同一ですが、１つの重要な違いがあります。

source: The example below iterates over each MediaItem in library, and prints an appropriate description for each item.
ja: 下の例は、上にlibraryの中の各々のMediaItemすべてに繰り返して、各項目の適切な説明を出力します。

source: The example below iterates over the items in the things array and queries the type of each item with a switch statement.
ja: 下の例は、things配列の中の項目のすべてに渡って繰り返して、switch文を使って各項目の型について問い合わせます。

source: The example below shows a closure expression version of the backward(_:_:) function from above:
ja: 下記の例は、上のbackward(_:_:)関数のクロージャ式版を示します：

source: The example below shows a simplified version of the Swift standard library’s generic dictionary type.
ja: 下の例は、スウィフト標準ライブラリの総称体辞書型の簡略版を示します。

source: The example below shows a version of the TrackedString structure in which the structure is defined with an explicit access level of public.
ja: 以下の例は、TrackedString構造体のある改作を示します、そこにおいてこの構造体は公開の明示的なアクセス水準を使って定義されます。

source: The example below shows an init? failable initializer that produces an optional instance of a structure.
ja: 下の例は、ある構造体のオプショナルインスタンスを生成する、失敗できるイニシャライザinit?を示します。

source: The example below shows how to implement the arithmetic addition operator (+) for a custom structure.
ja: 下の例は、あつらえの構造体のために算術加算演算子（+）を実装する方法を示します。

source: The example below shows how you can create a strong reference cycle when using a closure that references self.
ja: 下の例は、selfに参照をつけるクロージャを使うとき、あなたがどのように強い参照循環をつくることができるかについて示します。

source: The example below shows how you define and call a type subscript:
ja: 下の例は、どのようにあなたが型添え字を定義して呼び出すかを示します：

source: The example below shows the syntax for stored and computed type properties:
ja: 以下の例は、格納型プロパティおよび計算型プロパティのための構文を示します：

source: The example below takes an (x, y) point, expressed as a simple tuple of type (Int, Int), and categorizes it on the graph that follows the example.
ja: 下の例は、ポイント(x, y)、型(Int, Int)の単純なタプルとして表されるもの、をとって、その例に続くグラフ上でそれを分類します。

source: The example below takes an (x, y) point, expressed as a tuple of type (Int, Int), and categorizes it on the graph that follows:
ja: 下記の例は、ポイント(x, y)をとって、型(Int, Int)のタプルとして表し、それをあとに続くグラフに分類します：

source: The example below tries to access the street property of the address property of the residence property of john.
ja: 下の例は、johnのresidenceプロパティのaddressプロパティのstreetプロパティにアクセスしようとします。

source: The example below tries to retrieve the name of the first room in the rooms array of the john.residence property using the subscript defined on the Residence class.
ja: 下の例は、Residenceクラス上で定義される添え字を使って、john.residenceプロパティのrooms配列での最初の部屋の名前を取り出そうとします。

source: The example below uses fallthrough to create a textual description of a number.
ja: 下の例は、fallthroughをある数の文章での説明をつくるために使います。

source: The example below uses a lazy stored property to avoid unnecessary initialization of a complex class.
ja: 下の例は、ある複雑なクラスの必要でない初期化を避けるために遅延格納プロパティを使います。

source: The example below uses the initializer to try to convert a String into an Int:
ja: 下の例は、このイニシャライザを使用してStringをIntに変えることを試みます：

source: The example below uses the nil-coalescing operator to choose between a default color name and an optional user-defined color name:
ja: 以下の例は、nil合体演算子を、省略時の色の名前とオプショナルの利用者定義の色の名前とで選択するために使います：

source: The example can be read as:
ja: この例は、次のように解釈されることができます：

source: The example creates an array called things, which can store values of type Any:
ja: この例はthingsと呼ばれる配列をつくります、それは、Any型の値を格納することができます：

source: The example defines a Vector2D structure for a two-dimensional position vector (x, y), followed by a definition of an operator method to add together instances of the Vector2D structure:
ja: 例は、２次元の位置ベクトル(x, y)のためのVector2D構造体を定義します。そして、Vector2D構造体のインスタンスたちを１つに加えるための演算子メソッドの定義が続きます：

source: The example requires two supporting structures called Size and Point, both of which provide default values of 0.0 for all of their properties:
ja: この例は、SizeとPointと呼ばれる２つの補助する構造体を必要とします、その両方はそれらのプロパティすべてに0.0の省略時の値を提供します：

source: The example shown above demonstrates a custom implementation of a binary infix operator.
ja: 上で示される例は、二項接中辞演算子のあつらえの実装を示します。

source: The example shows how the == operator isn’t available—it depends on specific type information that isn’t preserved by using a protocol type.
ja: この例は、どのように==演算子が利用可能でないか示します — それは具体的な型情報に依存します、それはプロトコル型を使うことでは保全されないものです。

source: The example starts by trying to downcast the current item as a Movie.
ja: 例は、現在のitemをMovieとしてダウンキャストすることを試みることによって始まります。

source: The example then creates a new Person instance called birthdayPerson and passes this new instance to the wishHappyBirthday(to:) function.
ja: この例は、それからbirthdayPersonと呼ばれる新しいPersonインスタンスをつくって、この新しいインスタンスをwishHappyBirthday(to:)関数に渡します。

source: The example uses optional chaining to set the first item in the "Dave" array to 91; to increment the first item in the "Bev" array by 1; and to try to set the first item in an array for a key of "Brian".
ja: この例は、オプショナル連鎖を使って"Dave"配列の最初の項目を91に設定します；それから"Bev"配列の最初の項目を1だけ増加します；そしてそれから"Brian"のキーに対応する配列の最初の項目を設定することを試みます。

source: The examples above show how to use safe unowned references.
ja: 上の例は、どのようにsafe非所有参照を使うかを示します。

source: The examples below consider an array of strings representing the scene locations from the first two acts of Shakespeare’s Romeo and Juliet:
ja: 下の例は、シェークスピアのロミオとジュリエットの最初の２幕から、場面場所を表している文字列の配列を考えてみます：

source: The examples for weak and unowned references above cover two of the more common scenarios in which it’s necessary to break a strong reference cycle.
ja: 上の弱いおよび非所有参照のための例は、強い参照循環を壊すために不可欠なよくある筋書きのうちの２つを扱います。

source: The examples in the previous section show how the cases of an enumeration are a defined (and typed) value in their own right.
ja: 前の節での例は、列挙のケース節がどのように自分だけで定義された（そして型付けされた）値であるかについて示します。

source: The examples that follow use two stored type properties as part of a structure that models an audio level meter for a number of audio channels.
ja: あとに続く例は、いくつかのオーディオ・チャンネル用のオーディオ・レベルをモデル化する構造体の一部として、２つの格納型プロパティを使います。

source: The exclamation point effectively says, “I know that this optional definitely has a value; please use it.” This is known as forced unwrapping of the optional’s value:
ja: 感嘆符は、実際上こう言っています、「私はこのオプショナルが間違いなくひとつの値を持つことを知っています；どうぞそれを使ってください」。これは、そのオプショナルの所有する値の強制アンラップとして知られます：

source: The exponent consists of an upper- or lowercase e prefix followed by a sequence of decimal digits that indicates what power of 10 the value preceding the e is multiplied by.
ja: 指数は、大文字または小文字の接頭辞e、それに続けてeの前の値が10の何乗を掛けられるかを示す一連の10進の桁から成ります。

source: The exponent consists of an upper- or lowercase p prefix followed by a sequence of decimal digits that indicates what power of 2 the value preceding the p is multiplied by.
ja: 指数は、大文字または小文字のp接頭辞、それに続けてpの前の値が２の何乗を掛けられるかを示す一連の10進の桁から成ります。

source: The expression a += 2 is shorthand for a = a + 2.
ja: 式a += 2は、a = a + 2の簡略な表現です。

source: The expression a is always of an optional type.
ja: aの式は常にオプショナル型です。

source: The expression b must match the type that is stored inside a.
ja: bの式はaの中に格納される型に合致しなければなりません。

source: The expression is evaluated when the closure is created, and the value is captured with the specified strength.
ja: その式は、クロージャが作成される時に評価されます、そしてその値は、指定された強さでキャプチャされます。

source: The expression represented by the expression pattern is compared with the value of an input expression using the Swift standard library ~= operator.
ja: 式パターンによって表される式は、入力された式の値とスウィフト標準ライブラリ~=演算子を使って比較されます。

source: The expressions you write inside parentheses within an interpolated string can’t contain an unescaped backslash (\), a carriage return, or a line feed.
ja: 補間文字列においてあなたが丸括弧内に記述する式は、エスケープされないバックスラッシュ（\）、キャリッジリターン、またはラインフィードを含むことができません。

source: The fact that asHTML is a lazy property means that you can refer to self within the default closure, because the lazy property will not be accessed until after initialization has been completed and self is known to exist.
ja: asHTMLが遅延プロパティだという事実は、あなたが省略時のクロージャ内でselfに言及することができることを意味します、なぜなら、遅延プロパティは、初期化が完了されてしまってselfが存在することを知られる後までアクセスされることはないからです。

source: The fact that it is queried through an optional chain means that the call to numberOfRooms will always return an Int? instead of an Int.
ja: それがオプショナル連鎖によって問い合わせられるという事実は、numberOfRoomsへの呼び出しが常にInt?を返すことを意味します、Intではなく。

source: The fact that structures and enumerations can define methods in Swift is a major difference from C and Objective-C.
ja: 構造体と列挙がスウィフトにおいてはメソッドを定義することができるという事実は、CやObjective-Cとの重大な違いです。

source: The failable initializer for CartItem starts by validating that it has received a quantity value of 1 or more.
ja: CartItemのための失敗できるイニシャライザは、それが1以上のquantity値を受け取ったことを検証することによって始めます。

source: The fifth and sixth codeUnit values (55357 and 56374) are a UTF-16 surrogate pair representation of the DOG FACE character.
ja: ５番目と６番目のcodeUnit値（55357と56374）は、DOG FACE文字のUTF-16代用対叙述です。

source: The figure below illustrates how two of these audio channels can be combined to model a stereo audio level meter.
ja: 下の図は、これらの音声のチャンネルのうちの２つがステレオ音声のレベル・メーターをモデル化するために結合されることができる方法を図示します。

source: The figure below shows a more complex class hierarchy for four classes.
ja: 下の図は、４つのクラスのためのより複雑なクラス階層を示します。

source: The figure below shows the initializer chain for the Food class:
ja: 下の図は、Foodクラスのためのイニシャライザ連鎖を示します：

source: The figure below shows the initializer chain for the RecipeIngredient class:
ja: 下の図は、RecipeIngredientクラスのためのイニシャライザ連鎖を示します：

source: The figure below shows the overall initializer chain for all three classes:
ja: 下の図は、３つのクラス全てのために全体的なイニシャライザ連鎖を示します：

source: The figure below shows these relationships:
ja: 下の図は、それらの関係を示します：

source: The final else clause is optional, however, and can be excluded if the set of conditions does not need to be complete.
ja: しかしながら、最後のelse節は任意です、そして条件の集合が完全である必要がないならば、除外されることができます。

source: The final else clause remains, and it prints a response for any temperatures that are neither too warm nor too cold.
ja: 最後のelse節は同じままです、そしてそれはあまり暖かくもなくあまり寒くもないすべての気温に対しての応答を出力します。

source: The final case, case let (x, y), declares a tuple of two placeholder constants that can match any value.
ja: 最後のケース節、case let (x, y)は、どんな値にでも適合することができるプレースホルダ定数を２つもつタプルを宣言します。

source: The final class in this model is called Address.
ja: このモデルの中の最後のクラスは、Addressと呼ばれています。

source: The final code snippet above shows that the deinitializers for the Customer instance and CreditCard instance both print their “deinitialized” messages after the john variable is set to nil.
ja: 上の最後のコード断片は、CustomerインスタンスとCreditCardインスタンスのためのデイニシャライザが両方ともそれらの「デイニシャライズされた」メッセージを、john変数がnilに設定された後に出力することを示します。

source: The final snippet creates a constant array called library, which contains two Movie instances and three Song instances.
ja: 最終的な断片はlibraryと呼ばれる定数の配列をつくります、それは、２つのMovieインスタンスと３つのSongインスタンスを含みます。

source: The first Rect initializer, init(), is functionally the same as the default initializer that the structure would have received if it did not have its own custom initializers.
ja: 最初のRectイニシャライザ、init()は、構造体が独自のあつらえのイニシャライザを持たない場合に受け取る省略時のイニシャライザと機能的に同じものです。

source: The first and second requirements are defined in the function’s type parameter list, and the third and fourth requirements are defined in the function’s generic where clause.
ja: 最初と２番目の要件は関数のもつ型パラメータリストにおいて定義されます、そして３番目と４番目の要件は関数のもつ総称体where節において定義されます。

source: The first case, case (let x, 0), matches any point with a y value of 0 and assigns the point’s x value to the temporary constant x.
ja: 最初のケース節、case (let x, 0)は、0のy値をもつどんなポイントにでも適合して、そのポイントのx値を一時的な定数xに代入します。

source: The first example’s use of the ternary conditional operator means that rowHeight can be set to the correct value on a single line of code, which is more concise than the code used in the second example.
ja: 最初の例の三項条件演算子の使用は、rowHeightがただ１行のコードで正しい値に設定されることができるのを意味します、それは２番目の例において使われるコードより簡潔です。

source: The first form allows code to be executed only when a condition is true and has the following form:
ja: 最初の形式は、条件が真である時にだけコードが実行されるようにし、以下の形式を持ちます：

source: The first form emits the error message as a fatal error and terminates the compilation process.
ja: 最初の形式は、error message（エラーメッセージ）を致命的エラーとして発して、コンパイル処理を終わらせます。

source: The first form evaluates to the value of the expression.
ja: 最初の形式は、式の値に評価されます。

source: The first form is used to access a member of the superclass.
ja: 最初の形式は、スーパークラスのメンバーにアクセスするために使われます。

source: The first form of a line control statement changes the values of the #line and #file literal expressions, beginning with the line of code following the line control statement.
ja: 最初の形式の行制御文は、#lineと#fileリテラル式の値を変更して、行制御文の後に続くコードの行で始めます。

source: The first function, printAndCount(string:), prints a string, and then returns its character count as an Int.
ja: 最初の関数、printAndCount(string:)は、ある文字列を出力して、それからその文字数をIntとして返します。

source: The first initializer has a single initialization parameter with an argument label of fromFahrenheit and a parameter name of fahrenheit.
ja: 最初のイニシャライザは、fromFahrenheitの引数ラベルとfahrenheitのパラメータ名を使うただ１つの初期化パラメータを持ちます。

source: The first is a type function called unlock(_:), which updates the value of highestUnlockedLevel whenever a new level is unlocked.
ja: 第一は、unlock(_:)と呼ばれる型関数です、それは、新しいレベルが錠を開けられるときはいつでも、highestUnlockedLevelの値を更新します。

source: The first item in the array has an index of 0, not 1.
ja: 配列での最初の項目が、1ではなく、0のインデックスを持ちます。

source: The first item in the array represents the top left square on the board and the last item in the array represents the bottom right square on the board.
ja: 配列の最初の項目は盤上の一番左上の正方形を表わします、そして配列の最後の項目は盤上の一番右下の正方形を表します。

source: The first kind of pattern is used for destructuring values in simple variable, constant, and optional bindings.
ja: 最初の種類のパターンは、単純な変数、定数、およびオプショナル束縛での非構成の値に使われます。

source: The first letter of the case name is capitalized.
ja: ケース節の最初の文字は大文字で書かれます。

source: The first pair has a key of "YYZ" and a value of "Toronto Pearson".
ja: 最初の組みは、"YYZ"のキーと"Toronto Pearson"の値を持ちます。

source: The first parameter is called mathFunction, and is of type (Int, Int) -> Int.
ja: 最初のパラメータはmathFunctionと呼ばれていて、型(Int, Int) -> Intです。

source: The first situation is when you explicitly conform to the same protocol multiple times, but with different requirements.
ja: 第一の状況は、あなたが明示的に同じプロトコルに対しての複数回の準拠を、しかし異なる要件を使って行う時です。

source: The first snippet defines a new base class called MediaItem.
ja: 最初の断片は、MediaItemと呼ばれる新しい基盤クラスを定義します。

source: The first subclass, Movie, encapsulates additional information about a movie or film.
ja: 最初のサブクラスMovieは、映画またはフィルムに関する追加の情報をカプセル化します。

source: The first two calls succeed, because the testScores dictionary contains keys for "Dave" and "Bev".
ja: 最初の２つの呼び出しは成功します、なぜなら、testScores辞書は"Dave"と"Bev"のキーを含んでいるからです。

source: The first two properties, buildingName and buildingNumber, are alternative ways to identify a particular building as part of an address.
ja: 最初の２つのプロパティ、buildingNameとbuildingNumberは、アドレスの一部として特定の建物を同定するそれぞれ代替の方法です。

source: The first type parameter, T, has a type constraint that requires T to be a subclass of SomeClass.
ja: 最初の型パラメータTは、TにSomeClassのサブクラスであることを要求する型制約を持ちます。

source: The first, resolution, is initialized with a new Resolution structure instance, which infers a property type of Resolution.
ja: 一番目、resolutionは、新しいResolution構造体インスタンスで初期化されます、そしてそれは、Resolutionのプロパティ型を暗に意味します。

source: The first, thresholdLevel, defines the maximum threshold value an audio level can take.
ja: その一番目、thresholdLevelは、音声レベルがとることができる最大の限界値を定義します。

source: The fixity of the operator is specified by marking the operator declaration with the infix, prefix, or postfix declaration modifier before the operator keyword.
ja: 演算子の定着性は、演算子定義をoperatorキーワードの前にinfix、prefix、またはpostfix宣言修飾子を使って印することによって指定されます。

source: The following if statements are equivalent:
ja: 以下のif文は同等です：

source: The following approaches are equivalent:
ja: 以下の各取り組みは同等です：

source: The following are examples of literals:
ja: 以下はリテラルの例です：

source: The following characters are considered whitespace: space (U+0020), line feed (U+000A), carriage return (U+000D), horizontal tab (U+0009), vertical tab (U+000B), form feed (U+000C) and null (U+0000).
ja: 以下の文字は、空白とみなされます：空白（U+0020）、行送り（U+000A）、復帰（U+000D）、水平タブ（U+0009）、垂直タブ（U+000B）、改ページ（U+000C）およびヌル（U+0000）。

source: The following closure expressions are equivalent:
ja: 以下のクロージャ式は、等しいです：

source: The following code accesses different values and properties of a dictionary of arrays by using key-path expressions that combine these components.
ja: 以下のコードは、いくつかの配列からなる辞書に属する異なる値およびプロパティに、それらの構成要素を組み合わせるキーパス式を使うことでアクセスします。

source: The following code uses \.someProperty instead of \SomeClass.someProperty:
ja: 以下のコードは、\.somePropertyを\SomeClass.somePropertyの代わりに使います：

source: The following code uses the variable index in both a key-path expression and in a closure to access the third element of the greetings array.
ja: 以下のコードは、変数indexをキーパス式の中でそしてクロージャの中での両方で使うことで、greetings配列の３番目の要素にアクセスします。

source: The following example adds a new instance method called repetitions to the Int type:
ja: 以下の例は、repetitionsと呼ばれる新しいインスタンスメソッドをInt型に加えます：

source: The following example defines a Matrix structure, which represents a two-dimensional matrix of Double values.
ja: 以下の例はMatrix構造体を定義します、それはDouble値からなる２次元行列を表します。

source: The following example defines a class called SurveyQuestion, with an optional String property called response:
ja: 以下の例は、responseと呼ばれるオプショナルのStringプロパティで、SurveyQuestionと呼ばれるクラスを定義します：

source: The following example defines a custom Rect structure to represent a geometric rectangle.
ja: 以下の例は、あつらえのRect構造体を定義して、幾何学的な長方形を表わします。

source: The following example defines a new class called AutomaticCar, which is a subclass of Car.
ja: 以下の例はAutomaticCarと呼ばれる新しいクラスを定義します、それは、Carのサブクラスです。

source: The following example defines a new class called Car, which is a subclass of Vehicle.
ja: 以下の例は、Carと呼ばれる新しいクラスを定義します、それは、Vehicleのサブクラスです。

source: The following example defines a new custom infix operator called +-, which belongs to the precedence group AdditionPrecedence:
ja: 以下の例は、+-と呼びれる新しいあつらえの接中辞演算子を定義します、それは優先順位グループAdditionPrecedenceに属します：

source: The following example defines a new subclass of Vehicle called Train, which overrides the makeNoise() method that Train inherits from Vehicle:
ja: 以下の例は、Trainと呼ばれるVehicleの新しいサブクラスを定義します、それは、TrainがVehicleから受け継ぐmakeNoise()メソッドをオーバーライドします：

source: The following example defines a protocol with a single instance method requirement:
ja: 以下の例は、１つのインスタンスメソッド要件で、プロトコルを定義します：

source: The following example defines a structure called Celsius, which stores temperatures expressed in degrees Celsius.
ja: 以下の例は、Celsiusと呼ばれる構造体を定義します、それは、摂氏度数で表される温度を格納します。

source: The following example defines a structure called Color, with three constant properties called red, green, and blue.
ja: 以下の例はColorと呼ばれる構造体を定義します、それはred、green、そしてblueと呼ばれる３つの定数プロパティを使います。

source: The following example defines a subclass called Bicycle, with a superclass of Vehicle:
ja: 以下の例は、Vehicleのスーパークラスを持つ、Bicycleと呼ばれるサブクラスを定義します：

source: The following example defines an integer-counting class called Counter, which uses an external data source to provide its increment amount.
ja: 以下の例はCounterと呼ばれる整数計数クラスを定義します、それは、その増加量を提供するために外部のデータ・ソースを使います。
